/******************************************************************************
  Copyright (C), 2004-2050, Hisilicon Tech. Co., Ltd.
******************************************************************************
  File Name     : hilink_adapt.h
  Version       : Initial Draft
  Author        : Hisilicon WiFi software group
  Created       : 2016-06-06
  Last Modified :
  Description   : the API of hilink for user calls
  Function List :
  History       :
  1.Date        : 2016-06-06
  Author        :
  Modification  : Created file
******************************************************************************/
#ifndef __HILINK_ADAPT_H__
#define __HILINK_ADAPT_H__
#ifdef __cplusplus
#if __cplusplus
    extern "C" {
#endif
#endif
/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "hilink_link.h"
/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define OPEN_BASE_LEN                 62
#define WEP_BASE_LEN                  70
#define TKIP_BASE_LEN                 82
#define AES_BASE_LEN                  78
#define ONLINE_BUF_LEN                200
#ifndef NULL
#define NULL                          0
#endif
#define PARSE_FINISH                  0
#define MORE_TO_PARSE                 1

typedef void (*hilink_connect_cb)(void);

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
typedef enum
{
    RECEIVE_FLAG_OFF,
    RECEIVE_FLAG_ON,
    RECEIVE_FLAG_BUTT
}recevie_flag_enum;


/*****************************************************************************
  4 全局变量声明
*****************************************************************************/
struct hilink_datalist
{
    struct hilink_datalist *next;
    void *data;
    unsigned int length;
};




/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
int hisi_hilink_adapt_init(void);
int hisi_hilink_adapt_deinit(void);
int hisi_hilink_change_channel(void);
int hisi_hilink_online_notice(hilink_s_result* pst_result);
int hisi_hilink_parse_data(void);



#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif //__HILINK_ADAPT_H__

